[
  {
    "code": "A0101",
    "term": "Patient-Device Incompatibility",
    "definition": ["The device didn't work properly because my body rejected it.", "I experienced pain and discomfort because the device didn't fit well with my anatomy.", "The implant caused complications due to incompatibility with my body's structure.", "The device malfunctioned because it wasn't compatible with my physiology.", "I had to have the device removed because it didn't interact well with my body.", "The implant caused severe pain due to incompatibility with my anatomy.", "My doctor said the device wasn't suitable for my physiological condition.", "The device didn't perform as expected because it didn't match my anatomical needs.", "I experienced adverse effects because the device wasn't compatible with my body.", "The implant didn't integrate well with my anatomy, causing complications.", "The device failed because it wasn't compatible with my physiological condition.", "I had to stop using the device because it didn't interact well with my body.", "The implant caused issues due to incompatibility with my body's structure.", "The device didn't fit properly with my anatomy, causing discomfort.", "My body reacted poorly to the device because of incompatibility issues.", "The device didn't work well because it wasn't compatible with my physiology.", "I experienced significant discomfort due to the device not matching my anatomy.", "The implant caused problems because it didn't suit my physiological needs.", "The device malfunctioned because it didn't interact well with my body's structure.", "I had complications because the device wasn't compatible with my anatomy.", "The device didn't perform well due to incompatibility with my physiological condition.", "I had to have the device removed because it didn't fit my anatomy properly.", "The implant caused severe issues because it wasn't suitable for my body's structure.", "The device didn't match my physiological needs, causing complications.", "My doctor said the device wasn't suitable for my anatomical condition.", "The implant caused discomfort because it wasn't compatible with my body's structure.", "The device didn't work properly due to incompatibility with my physiology.", "I experienced adverse effects because the device didn't fit my anatomy well.", "The implant caused severe pain because it wasn't compatible with my body's structure.", "The device failed to perform due to physiological incompatibility.", "I had to have the device removed because it didn't work well with my anatomy.", "The implant didn't suit my physiological condition, causing complications.", "The device didn't fit properly, leading to significant discomfort.", "My body rejected the device due to incompatibility issues.", "The device didn't interact well with my body's structure, causing problems.", "I experienced adverse effects because the device wasn't suitable for my physiology.", "The implant caused severe complications due to incompatibility with my anatomy.", "The device didn't perform as expected because it wasn't compatible with my body.", "I had to stop using the device because it didn't match my anatomical needs.", "The implant caused significant pain due to incompatibility with my body's structure.", "The device malfunctioned because it didn't suit my physiological condition.", "I had complications because the device didn't fit well with my anatomy.", "The device didn't work properly due to incompatibility with my body's structure.", "I experienced discomfort because the device wasn't compatible with my physiology.", "The implant caused issues because it didn't match my anatomical needs.", "The device didn't interact well with my body's structure, leading to complications.", "The implant caused severe discomfort due to physiological incompatibility.", "The device failed because it wasn't suitable for my anatomical condition.", "I had to stop using the device because it didn't work well with my physiology.", "The device caused significant problems due to incompatibility with my body's structure."]
  },
  {
    "code": "A010101",
    "term": "Biocompatibility",
    "definition": ["I experienced a severe allergic reaction to the materials in the implant.", "The device caused a local infection that my doctor attributed to material leachates.", "I had swelling and redness around the implant site due to the device's materials.", "The implant caused systemic inflammation after it was inserted.", "I developed a rash on my skin where the device was placed.", "The materials in the device caused my skin to break out in hives.", "I experienced nausea and dizziness after the implant procedure, which my doctor said was due to the device's materials.", "The device caused my skin to blister and peel.", "I had a fever and chills after the device was implanted, which was linked to the materials used.", "The implant caused a severe local reaction that required removal.", "I experienced joint pain after receiving the implant, which my doctor said was due to the device materials.", "The materials in the device caused significant irritation and itching.", "I developed a severe local reaction that my doctor attributed to material leachates from the device.", "The implant caused a widespread rash and discomfort.", "I had a severe reaction to the device, causing both local and systemic issues.", "The materials in the device caused my skin to become inflamed and tender.", "I experienced chronic pain at the implant site, which my doctor said was due to material incompatibility.", "The device caused a systemic allergic reaction that required medical treatment.", "I had to have the implant removed because of a severe reaction to its materials.", "The device's materials caused me to develop a serious skin infection.", "I experienced significant discomfort and swelling around the device.", "The materials in the implant caused a severe inflammatory response.", "I had a bad reaction to the device, which included skin irritation and systemic symptoms.", "The implant caused my skin to turn red and swell up.", "I experienced severe itching and discomfort from the device materials.", "The materials in the device led to an infection that needed antibiotics.", "I had a severe skin reaction to the device, leading to its removal.", "The implant caused me to develop a systemic rash and fever.", "The device's materials caused a significant local reaction at the implant site.", "I experienced nausea and headaches from the device's materials.", "The implant caused chronic inflammation and discomfort.", "The materials in the device led to severe skin irritation and peeling.", "I had a bad reaction to the device, causing local and systemic problems.", "The implant caused me to have a persistent rash and swelling.", "I experienced a severe allergic reaction to the materials used in the device.",  "The device caused me to develop a serious skin condition.", "I had a systemic inflammatory response to the implant materials.", "The materials in the device caused severe local irritation.", "I experienced significant pain and discomfort from the device materials.", "The implant led to a severe local and systemic reaction.", "I had a bad reaction to the device, which included fever and skin irritation.", "The materials in the device caused my skin to become red and swollen.", "I experienced a severe local reaction that my doctor said was due to material leachates.", "The device caused significant swelling and discomfort at the implant site.", "I had a systemic allergic reaction to the materials in the implant.", "The materials in the device caused a severe local infection.", "I experienced severe pain and swelling from the device materials.", "The implant led to chronic irritation and discomfort.", "I had a bad reaction to the device, causing both local and systemic symptoms.", "The materials in the device caused a severe reaction that required medical intervention."]
  },
  {
    "code": "A010103",
    "term": "Inadequacy of Device Shape and/or Size",
    "definition": ["The device was too large for my wrist and caused discomfort when I wore it.", "My doctor said the implant was too small for my anatomy, leading to complications.", "I found the device too bulky to fit properly in the intended location.", "The size of the device didn't match the measurements provided, making it unusable.", "The shape of the implant didn't conform to my anatomy, causing irritation.", "I had trouble using the device because it was too big for the intended area.", "The device's dimensions were unsuitable for my body type.", "My physician mentioned the device was not the right shape for my anatomy.", "The gadget was too small and didn't provide the necessary support.", "The shape of the device was awkward and didn't fit my anatomy well.", "I experienced discomfort because the device was too large for the implantation site.", "The product didn't fit properly due to its size, making it ineffective.", "The device's size was too big, causing pain and discomfort.", "The shape of the device made it difficult to position correctly.", "The size and shape of the device were not compatible with my anatomical structure.", "The device was too bulky to be used effectively in the prescribed manner.", "I had issues with the device because it was not the right size for my anatomy.", "The implant didn't fit well due to its shape, causing complications.", "The device was too small and didn't cover the area it was supposed to.", "The shape of the device made it impossible to fit it properly.", "The size of the device was inadequate, leading to discomfort and improper use.", "The device's shape didn't match my anatomy, making it uncomfortable.", "The size of the device was not appropriate for my needs, causing issues.", "The gadget was too large and didn't fit the intended area correctly.", "I couldn't use the device properly because its shape didn't conform to my anatomy.", "The device didn't fit my body properly due to its awkward shape.", "The dimensions of the device were too large, making it unusable for my needs.", "The shape of the implant was not compatible with my anatomy, causing issues.", "The device was too small to be effective in my case.", "The product was too bulky and didn't align with my anatomical structure.", "I couldn't get the device to fit correctly because it was too big.", "The size of the device was inappropriate for my body type.", "The shape of the device caused discomfort due to poor anatomical fit.", "The gadget was too large for the area it needed to be used in.", "The size and shape of the device were not suitable for my anatomy.", "The implant didn't conform to my body, leading to discomfort.", "The device was too small and didn't serve its purpose effectively.", "The product was oversized and didn't fit in the intended area.", "The shape of the device made it difficult to use correctly.", "The size of the gadget was too large for my wrist, causing issues.", "The device didn't fit properly due to its shape being incompatible with my anatomy.", "The size was too small to cover the necessary area.", "The device's shape didn't match the contours of my body.", "The product was too big, causing discomfort and inefficiency.", "The device was not the right shape for my anatomy, leading to complications.", "The dimensions were too small for the device to work properly.", "The shape of the device was awkward and didn't fit my body correctly.", "The device was too large for its intended purpose, causing problems.", "The gadget didn't fit due to its size being inappropriate for my anatomy.", "The shape of the device made it difficult to position correctly on my body."]
  },
  {
    "code": "A0102",
    "term": "Osseointegration Problem",
    "definition": ["The implant didn't integrate properly with my bone, causing instability.", "I experienced pain because the bone didn't fuse well with the device.", "The implant remained loose due to poor osseointegration.", "My doctor said the implant failed to integrate with my bone tissue.", "I had to undergo another surgery because the device didn't bond with my bone.", "The implant caused issues because it didn't connect well with my bone.", "The device didn't anchor properly due to osseointegration problems.", "I experienced discomfort because my bone didn't accept the implant.", "The implant failed because it didn't integrate with the surrounding bone.", "My bone didn't grow into the implant, causing instability.", "The device caused pain because it didn't fuse properly with my bone.", "I had complications because the implant didn't bond with my bone tissue.", "The implant remained unstable due to poor integration with my bone.", "The device didn't integrate properly, leading to significant discomfort.", "My bone didn't connect well with the implant, causing issues.", "The implant caused instability because it didn't fuse with my bone.", "The device failed to integrate with my bone tissue, causing problems.", "I had to have the implant removed due to poor osseointegration.", "The implant didn't bond well with my bone, leading to instability.", "I experienced pain and discomfort because the implant didn't integrate properly.", "The device caused complications due to poor osseointegration.", "My doctor said the implant didn't connect well with my bone tissue.", "The implant didn't integrate, causing instability and discomfort.", "I had issues because the device didn't fuse properly with my bone.", "The implant caused problems because it didn't bond with my bone tissue.", "The device failed to integrate, leading to pain and instability.", "I had to undergo additional treatment because the implant didn't connect with my bone.", "The implant didn't fuse well with my bone, causing significant issues.", "My bone didn't accept the device, leading to complications.", "The implant caused pain due to poor integration with my bone.", "The device remained unstable because it didn't bond with my bone tissue.", "I had to have the implant removed due to integration problems with my bone.", "The implant didn't connect properly with my bone, causing discomfort.", "My doctor said the device failed to integrate with my bone tissue.", "I experienced complications because the implant didn't bond with my bone.", "The device didn't fuse well with my bone, causing instability.", "The implant caused issues due to poor osseointegration.", "My bone didn't grow into the implant, leading to problems.", "The device remained loose because it didn't integrate properly with my bone.", "I had pain and discomfort because the implant didn't connect with my bone tissue.", "The implant didn't bond well with my bone, causing complications.", "The device failed to integrate, leading to instability and pain.", "My doctor said the implant didn't fuse properly with my bone tissue.", "I experienced issues because the implant didn't connect well with my bone.", "The implant caused instability due to poor osseointegration.", "The device didn't integrate with my bone, leading to discomfort.", "I had to have the implant removed because it didn't bond with my bone tissue.", "The implant caused pain because it didn't connect well with my bone.", "My bone didn't fuse with the implant, causing significant issues.", "The device didn't integrate properly, leading to complications and instability."]
  },
  {
    "code": "A0103",
    "term": "Loosening of Implant Not Related to Bone-Ingrowth",
    "definition": ["My implant has become loose over time and is causing discomfort.", "The device shifted position due to loosening, not related to bone growth.", "I experienced instability because the implant started loosening.", "The implant didn't stay anchored and is moving around.", "The device became loose after an injury, leading to pain.", "The implant lost its tight fit and is causing problems.", "My doctor said the implant has loosened and needs to be fixed.", "I had to get the implant checked because it felt loose.", "The device started to wiggle and isn't secure anymore.", "I experienced pain due to the implant loosening over time.", "The implant is no longer stable and has become loose.", "The device has shifted because it loosened, not due to bone issues.", "My implant feels unstable and is moving around.", "The device lost its anchorage and needs to be adjusted.", "I felt the implant become loose and it's causing discomfort.", "The implant isn't holding firm and is causing instability.", "My doctor noticed the implant has loosened since the surgery.", "I had complications because the device became loose.", "The implant shifted due to loosening, leading to pain.", "The device isn't staying in place and has loosened.", "My implant started to move around because it became loose.", "The device became unstable and needs to be re-secured.", "I had to see a specialist because the implant loosened.", "The implant is not fixed firmly anymore and is causing issues.", "The device loosened over time, leading to discomfort.", "My implant has become loose and is moving around.", "The device lost its secure fit and is causing pain.", "The implant isn't stable because it has loosened.", "My doctor said the implant needs to be tightened because it loosened.", "I experienced discomfort because the device is loose.", "The implant shifted position due to loosening.", "The device isn't staying anchored and has loosened.", "I had pain because the implant became loose after an injury.", "The implant is wiggling and isn't secure anymore.", "The device loosened over time and is causing instability.", "My implant has shifted because it became loose.", "The device lost its firm anchorage and needs attention.", "I felt the implant move because it loosened.", "The implant is no longer stable due to loosening.", "The device needs to be adjusted because it has loosened.", "My implant started to feel loose and is causing problems.", "The device isn't holding firm and has become loose.", "My doctor noticed the implant became loose and needs fixing.", "I had issues because the device loosened over time.", "The implant shifted due to loosening, causing pain.", "The device isn't secure anymore and has loosened.", "My implant is moving around because it became loose.", "The device became unstable and needs re-securing.", "I had to consult a specialist because the implant loosened.", "The implant is causing discomfort because it has loosened."]
  }
]