[
    {
        "code": "A0101",
        "definition": "Hello, it’s a Dr. Ryan, we're encountering a problem with your device because it is incompatible with the patient's physiological characteristics."
    },
    {
        "code": "A0101",
        "definition": "Hello, we have encountered an issue with the device. It did not suit the patient's anatomical needs, resulting in significant discomfort for the patient. Please advise on how to proceed."
    },
    {
        "code": "A0301",
        "definition": "Hello, we have encountered a significant problem with the device. An unexpected smell emanating from it has led to multiple patient complaints. Please advise on the next steps to address this issue."
    },
    {
        "code": "A0301",
        "definition": "Hello, we have identified an issue with the device. It emitted an unanticipated odor, which resulted in patient discomfort. Please advise on how to address this problem."
    },
    {
        "code": "A0401",
        "definition": "Hello, the patient encountered problems due to damage to the materials used in the device's construction."
    },
    {
        "code": "A0501",
        "definition": "Hello, the patient experienced issues because the device became detached from its physical structure. This separation occurred due to a failure in the adhesive materials used during the device's construction. As a result, the device was unable to maintain its intended position, leading to complications for the patient. We are currently investigating the cause of the adhesive failure and evaluating potential solutions to prevent such issues in the future."
    },
    {
        "code": "A090401",
        "definition": "Hello, the patient experienced problems because the energy output from the device was not within the expected part of the spectrum. This misalignment in the energy output resulted in ineffective or adverse effects during the therapy. We are investigating the cause of this deviation to ensure the device operates within the correct parameters and to prevent similar issues in the future."
    },
    {
        "code": "B01",
        "definition": "Hello, we have conducted an investigation involving empirical testing of the device suspected in the reported adverse event. This was to determine its functional properties and identify potential causes of the issue."
    },
    {
        "code": "B03",
        "definition": "Hello, we are conducting testing on the device from the same lot/batch that was returned by the user. This testing aims to identify any issues and determine if the device from this batch exhibits similar problems. We will provide updates on our findings and any necessary actions based on the results."
    },
    {
        "code": "B11",
        "definition": "Hello, our investigation included analyzing historical adverse event data for the device involved in the current issue, as well as reviewing data from products from the same or different batches/lots. This comprehensive analysis aims to identify any patterns or recurring issues that may have contributed to the adverse event."
    },
    {
        "code": "B14",
        "definition": "Hello, our investigation involved reviewing relevant production records to help identify potential causes of the adverse event. This analysis aims to support our understanding of any issues related to the device's manufacturing process."
    },
    {
        "code": "B18",
        "definition": "Hello, the device involved in the adverse event has already been discarded and is therefore irretrievably lost for further testing. We are focusing on reviewing available data and records to understand the issue and prevent future occurrences."
    },
    {
        "code": "C0101",
        "definition": "Hello, we have found that the device induces cellular or tissue responses, resulting in unwanted local or systemic effects in the recipient of the therapy."
    },
    {
        "code": "C0105",
        "definition": "Hello, we are investigating the device's potential to cause damage to genetic material, such as leading to the development of malignant tumors. This assessment is crucial to ensure patient safety and to address any risks associated with the device."
    },
    {
        "code": "C0207",
        "definition": "Hello, we are investigating issues related to the power source supplying electrical energy to the device. Problems with this source could be affecting the device's performance and reliability. We are examining the power source to identify any faults and ensure proper functionality."
    },
    {
        "code": "C0401",
        "definition": "Hello, we are addressing issues with devices that fail to send or receive adequate signals, which affects their interoperability with other equipment. This problem can impact the overall effectiveness of the device and its ability to communicate properly."
    },
    {
        "code": "C070603",
        "definition": "Hello, we are investigating problems caused by the separation of a component, object, or material into two or more pieces, including issues related to shear. This separation can lead to malfunction or compromised performance of the device."
    },
    {
        "code": "D0101",
        "definition": "Hello, issues have been identified related to the design or design features of the device that hinder or interfere with its intended purpose. These design-related problems may impact the device's effectiveness and overall performance."
    },
    {
        "code": "D0107",
        "definition": "Hello, problems have been traced to inadequate protection of computers, servers, mobile devices, electronic systems, networks, programs, and data from malicious attacks, damage, or unauthorized access. These vulnerabilities may compromise the security and integrity of the system."
    },
    {
        "code": "D07",
        "definition": "Hello, issues have been traced to improper routine or preventative maintenance. These maintenance shortcomings may have led to device malfunctions or performance problems."
    },
    {
        "code": "D1002",
        "definition": "Hello, the adverse event occurred during the procedure, and it has been determined that the device had no influence on the event. Further investigation confirmed that the device's operation was within expected parameters at the time."
    },
    {
        "code": "D1106",
        "definition": "Hello, problems have been traced to the use of the device multiple times, despite it being designed for single-use only. This repeated use may have led to performance issues or complications."
    },
    {
        "code": "E0102",
        "definition": "Hello, there has been reported damage to the brain. This issue is currently under investigation to determine its cause and address any related concerns."
    },
    {
        "code": "E010702",
        "definition": "Hello, there has been a loss of intellectual abilities that is interfering with an individual's social and occupational functions. This issue is under investigation to understand its impact and identify potential causes."
    },
    {
        "code": "E073301",
        "definition": "Hello, there has been an acute inflammation of the walls of the terminal bronchioles. This condition is being investigated to determine its cause and impact on the patient's health."
    },
    {
        "code": "E0903",
        "definition": "Hello, there has been a partial or complete loss of the ability to detect or understand sounds due to damage to the outer, middle, or inner ear structures. This condition is being evaluated to assess its impact and identify the underlying cause."
    },
    {
        "code": "E1518",
        "definition": "Hello, there is concern that children affected by toxins may be linked to silicone breast implants and their potential effects on unborn children and from breastfeeding. This issue is under investigation to understand the possible impact and ensure safety."
    },
    {
        "code": "F0101",
        "definition": "Hello, there has been a reduction in the desirable and beneficial effects resulting from the medical treatment. This issue is being examined to understand its impact and identify possible adjustments or solutions."
    },
    {
        "code": "F04",
        "definition": "Hello, the patient's diagnosis was clinically significant delayed due to issues with the device's performance. This delay is being investigated to understand its impact and to prevent future occurrences."
    },
    {
        "code": "F1001",
        "definition": "Hello, the patient's treatment was delayed due to issues with the device's performance. This situation is being reviewed to understand the impact and address any contributing factors."
    },
    {
        "code": "F1204",
        "definition": "Hello, there has been irreversible deterioration in the state of health. This serious condition is being investigated to determine its cause and to address any related issues."
    },
    {
        "code": "F22",
        "definition": "Hello, a diagnostic intervention that was not originally planned had to be completed. This additional procedure was necessary to address unforeseen issues and ensure accurate diagnosis and treatment."
    },
    {
        "code": "G01007",
        "definition": "Hello, the powder that reacts with the monomer liquid to form adhesive, resin, or cement is used in various applications. This reaction is crucial for the effective creation of these materials."
    },
    {
        "code": "G02003",
        "definition": "Hello, a device designed to restore the capacity of a battery is intended to enhance the battery’s performance and extend its usable life. This device is crucial for maintaining battery efficiency and reliability."
    },
    {
        "code": "G04029",
        "definition": "Hello, a layer of material covering the surface of a device is used to protect and enhance its functionality. This coating can offer various benefits, such as improving durability, providing insulation, or enhancing aesthetics."
    },
    {
        "code": "G04094",
        "definition": "Hello, the outer wrapping around a device serves to contain, identify, and protect it before use. This packaging ensures the device remains secure and identifiable until it is ready for deployment."
    },
    {
        "code": "G05003",
        "definition": "Hello, a component designed to create or record a visual representation is crucial for generating or capturing images. This component is fundamental in devices such as cameras, screens, and imaging systems, enabling the creation and storage of visual content."
    }
]